In [1]:
import pandas as pd
df=pd.read_csv("MARKS.csv")
df

    S.No Name  Marks
0      1    A     10
1      2    B     12
2      3    C      8
3      4    D      9
4      5    E     10
5      6    F     12
6      7    G      9
7      8    H      6
8      9    I      8
9     10    J      9
10    11    K     10

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   S.No    11 non-null     int64
 1   Name    11 non-null     object
 2   Marks   11 non-null     int64
dtypes: int64(2), object(1)
memory usage: 392.0+ bytes

In [5]:
df.head(7)

   S.No Name  Marks
0     1    A     10
1     2    B     12
2     3    C      8
3     4    D      9
4     5    E     10
5     6    F     12
6     7    G      9

In [6]:
df.tail(10)

    S.No Name  Marks
1      2    B     12
2      3    C      8
3      4    D      9
4      5    E     10
5      6    F     12
6      7    G      9
7      8    H      6
8      9    I      8
9     10    J      9
10    11    K     10

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df[["Name","Marks"]]

   Name  Marks
0     A     10
1     B     12
2     C      8
3     D      9
4     E     10
5     F     12
6     G      9
7     H      6
8     I      8
9     J      9
10    K     10

In [9]:
df["Marks"].max()

12

In [10]:
df["Marks"]>8

0      True
1      True
2     False
3      True
4      True
5      True
6      True
7     False
8     False
9      True
10     True
Name: Marks, dtype: bool

In [12]:
df[df["Marks"]>8]

    S.No Name  Marks
0      1    A     10
1      2    B     12
3      4    D      9
4      5    E     10
5      6    F     12
6      7    G      9
9     10    J      9
10    11    K     10

In [13]:
print(df.loc[4])

S.No      5
Name      E
Marks    10
Name: 4, dtype: object

In [14]:
print(df.iloc[4])

S.No      5
Name      E
Marks    10
Name: 4, dtype: object

In [17]:
df["dept"]=["eee","ece","cse","eee","ece","cse","ece","cse","eee","cse","ece"]
print(df)

    S.No Name  Marks dept
0      1    A     10  eee
1      2    B     12  ece
2      3    C      8  cse
3      4    D      9  eee
4      5    E     10  ece
5      6    F     12  cse
6      7    G      9  ece
7      8    H      6  cse
8      9    I      8  eee
9     10    J      9  cse
10    11    K     10  ece

In [23]:
df.loc[2]

S.No       3
Name       C
Marks      8
dept     cse
Name: 2, dtype: object

In [25]:
print(df.loc[df["Marks"]>8])

    S.No Name  Marks dept
0      1    A     10  eee
1      2    B     12  ece
3      4    D      9  eee
4      5    E     10  ece
5      6    F     12  cse
6      7    G      9  ece
9     10    J      9  cse
10    11    K     10  ece

In [27]:
df.loc[1,"Name"]

'B'

In [28]:
df.loc[2,"Marks"]

8

In [30]:
df["Name"]

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
Name: Name, dtype: object